# GetChangePriority Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IUpdater..::..GetChangePriority Method
IUpdater Interface See Also
---
Identifies the nature of the change the Updater will be performing Used to identify order of execution of updaters Called once during registration of the updater
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
ChangePriority GetChangePriority()
```

Visual Basic
---
```text
Function GetChangePriority As ChangePriority
```

Visual C++
---
```text
ChangePriority GetChangePriority()
```

# See Also
IUpdater Interface
Autodesk.Revit.DB Namespace